character/app/controllers/souls_controller.rb

  def show
    @soul = Soul.find(params[:id])
---
SELECT * FROM `souls` WHERE (`souls`.`id` = 1)

  def edit
    @soul = Soul.find(params[:id])
---
SELECT * FROM `souls` WHERE (`souls`.`id` = 1)

  def create
    @soul = Soul.new(params[:soul])
    @soul.user_id = session[:user_id]

    respond_to do |format|
      if @soul.save
---
INSERT INTO `souls` (`name`, `created_at`, `personality_type`, `physical`, `updated_at`, `gender`, `user_id`, `career`, `quirks1`, `visual_guide`, `quirks2`, `backstory`, `age`, `style`, `quirks3`) VALUES('Billy Bo Bo Boy', '2009-03-04 03:55:07', '', '', '2009-03-04 03:55:07', '', 1, '', '', '', '', '', '', '', '')

  def update
    @soul = Soul.find(params[:id])

    respond_to do |format|
      if @soul.update_attributes(params[:soul])
---
SELECT * FROM `souls` WHERE (`souls`.`id` = 1)
UPDATE `souls` SET `updated_at` = '2009-03-04 16:18:46', `physical` = 'WAY sexy fat manish woman.', `visual_guide` = 'http://i235.photobucket.com/albums/ee281/EndersJKE/fatjosh.jpg' WHERE `id` = 4

  def destroy
    @user = User.find(session[:user_id])
    id = params[:id]
    @soul = @user.souls.find(id).destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `souls` WHERE `id` = 2
SELECT * FROM `souls` WHERE (`souls`.`id` = 7 AND (`souls`.user_id = 1))