character/app/controllers/stories_controller.rb

  def show
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def edit
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def create
    @story = Story.new(params[:story])

    respond_to do |format|
      if @story.save
---
INSERT INTO `stories` (`name`, `created_at`, `updated_at`, `user_id`, `description`) VALUES('Pirates of the Carebears', '2009-02-18 22:21:10', '2009-02-18 22:21:10', 1, 'Some pirates and stuff. Maybe soem girls. Well, yeah, of course girls.')

  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)
UPDATE `stories` SET `updated_at` = '2009-03-03 23:15:39', `description` = 'Some pirates and stuff. Maybe some girls. Well, yeah, of course girls.' WHERE `id` = 1