character/app/controllers/theatre_controller.rb

  def stage
    @user = User.find(session[:user_id])
    @souls = Soul.find(:all, :conditions => [ "user_id = ?", @user.id], :order => "name")
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
SELECT * FROM `souls` WHERE (user_id = '--- :user_id\n') ORDER BY name