character/app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`name` = BINARY 'Terry') LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` = 2)
---
  def edit
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('Jeremy', '185652900.640017179397232', '2009-01-23 18:46:59', '2009-01-23 18:46:59', 'f3f7ac728ae88bca09846d739a1bd6b57d2f02dd')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2009-03-04 00:37:50', `salt` = '193931300.698305145773581', `hashed_password` = '31f14dbf1468b576164f737766a320ffc3cdb8e4' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy